# VoltageTypeSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageTypeSet Constructor
VoltageTypeSet Class See Also
---
Initializes a new instance of the VoltageTypeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public VoltageTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
VoltageTypeSet()
```

# See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace